lkolbly/cmsis-svd/data/TexasInstruments/LM4F122H5QC.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>WTIMER1</name>
      <prependToName>WTIMER1</prependToName>
      <baseAddress>0x40037000</baseAddress>
    </peripheral>
    <peripheral>
      <name>ADC0</name>
      <description>Register map for ADC0 peripheral</description>
      <groupName>ADC</groupName>
      <prependToName>ADC0</prependToName>
      <baseAddress>0x40038000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ACTSS</name>
          <description>ADC Active Sample Sequencer</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>ADC_ACTSS_ASEN0</name>
              <description>ADC SS0 Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_ACTSS_ASEN1</name>
              <description>ADC SS1 Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_ACTSS_ASEN2</name>
              <description>ADC SS2 Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_ACTSS_ASEN3</name>
              <description>ADC SS3 Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>ADC Raw Interrupt Status</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>ADC_RIS_INR0</name>
              <description>SS0 Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_RIS_INR1</name>
              <description>SS1 Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_RIS_INR2</name>
              <description>SS2 Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_RIS_INR3</name>
              <description>SS3 Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_RIS_INRDC</name>
              <description>Digital Comparator Raw Interrupt Status</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>ADC Interrupt Mask</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>ADC_IM_MASK0</name>
              <description>SS0 Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_IM_MASK1</name>
              <description>SS1 Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_IM_MASK2</name>
              <description>SS2 Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_IM_MASK3</name>
              <description>SS3 Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_IM_DCONSS0</name>
              <description>Digital Comparator Interrupt on SS0</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC_IM_DCONSS1</name>
              <description>Digital Comparator Interrupt on SS1</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADC_IM_DCONSS2</name>
              <description>Digital Comparator Interrupt on SS2</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADC_IM_DCONSS3</name>
              <description>Digital Comparator Interrupt on SS3</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ISC</name>
          <description>ADC Interrupt Status and Clear</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>ADC_ISC_IN0</name>
              <description>SS0 Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_IN1</name>
              <description>SS1 Interrupt Status and Clear</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_IN2</name>
              <description>SS2 Interrupt Status and Clear</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_IN3</name>
              <description>SS3 Interrupt Status and Clear</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_DCINSS0</name>
              <description>Digital Comparator Interrupt Status on SS0</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_DCINSS1</name>
              <description>Digital Comparator Interrupt Status on SS1</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_DCINSS2</name>
              <description>Digital Comparator Interrupt Status on SS2</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADC_ISC_DCINSS3</name>
              <description>Digital Comparator Interrupt Status on SS3</description>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSTAT</name>
          <description>ADC Overflow Status</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>ADC_OSTAT_OV0</name>
              <description>SS0 FIFO Overflow</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_OSTAT_OV1</name>
              <description>SS1 FIFO Overflow</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_OSTAT_OV2</name>
              <description>SS2 FIFO Overflow</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_OSTAT_OV3</name>
              <description>SS3 FIFO Overflow</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMUX</name>
          <description>ADC Event Multiplexer Select</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>ADC_EMUX_EM0</name>
              <description>SS0 Trigger Select</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_PROCESSOR</name>
                  <description>Processor (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_COMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_COMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_COMP2</name>
                  <description>Analog Comparator 2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_EXTERNAL</name>
                  <description>External (GPIO PB4)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_TIMER</name>
                  <description>Timer</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM0_ALWAYS</name>
                  <description>Always (continuously sample)</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_EMUX_EM1</name>
              <description>SS1 Trigger Select</description>
              <bitRange>[7:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_PROCESSOR</name>
                  <description>Processor (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_COMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_COMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_COMP2</name>
                  <description>Analog Comparator 2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_EXTERNAL</name>
                  <description>External (GPIO PB4)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_TIMER</name>
                  <description>Timer</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM1_ALWAYS</name>
                  <description>Always (continuously sample)</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_EMUX_EM2</name>
              <description>SS2 Trigger Select</description>
              <bitRange>[11:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_PROCESSOR</name>
                  <description>Processor (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_COMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_COMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_COMP2</name>
                  <description>Analog Comparator 2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_EXTERNAL</name>
                  <description>External (GPIO PB4)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_TIMER</name>
                  <description>Timer</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM2_ALWAYS</name>
                  <description>Always (continuously sample)</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_EMUX_EM3</name>
              <description>SS3 Trigger Select</description>
              <bitRange>[15:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_PROCESSOR</name>
                  <description>Processor (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_COMP0</name>
                  <description>Analog Comparator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_COMP1</name>
                  <description>Analog Comparator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_COMP2</name>
                  <description>Analog Comparator 2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_EXTERNAL</name>
                  <description>External (GPIO PB4)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_TIMER</name>
                  <description>Timer</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_EMUX_EM3_ALWAYS</name>
                  <description>Always (continuously sample)</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USTAT</name>
          <description>ADC Underflow Status</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>ADC_USTAT_UV0</name>
              <description>SS0 FIFO Underflow</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_USTAT_UV1</name>
              <description>SS1 FIFO Underflow</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_USTAT_UV2</name>
              <description>SS2 FIFO Underflow</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_USTAT_UV3</name>
              <description>SS3 FIFO Underflow</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSPRI</name>
          <description>ADC Sample Sequencer Priority</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>ADC_SSPRI_SS0</name>
              <description>SS0 Priority</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_SSPRI_SS0_1ST</name>
                  <description>First priority</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SSPRI_SS0_2ND</name>
                  <description>Second priority</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SSPRI_SS0_3RD</name>
                  <description>Third priority</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SSPRI_SS0_4TH</name>
                  <description>Fourth priority</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_SSPRI_SS1</name>
              <description>SS1 Priority</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_SSPRI_SS1_1ST</name>
                  <description>First priority</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SSPRI_SS1_2ND</name>
                  <description>Second priority</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SSPRI_SS1_3RD</name>
                  <description>Third priority</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SSPRI_SS1_4TH</name>
                  <description>Fourth priority</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_SSPRI_SS2</name>
              <description>SS2 Priority</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_SSPRI_SS2_1ST</name>
                  <description>First priority</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SSPRI_SS2_2ND</name>
                  <description>Second priority</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SSPRI_SS2_3RD</name>
                  <description>Third priority</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SSPRI_SS2_4TH</name>
                  <description>Fourth priority</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_SSPRI_SS3</name>
              <description>SS3 Priority</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_SSPRI_SS3_1ST</name>
                  <description>First priority</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SSPRI_SS3_2ND</name>
                  <description>Second priority</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SSPRI_SS3_3RD</name>
                  <description>Third priority</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SSPRI_SS3_4TH</name>
                  <description>Fourth priority</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
